In [12]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
import warnings
warnings.filterwarnings('ignore')

# Contents
 - EDA
 - histogram
 - distributions

## # EDA

In [13]:
d = sns.load_dataset('titanic')
print(d.shape)
d.head(2)

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [14]:
d['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [15]:
d['class'].value_counts().sort_index()

First     216
Second    184
Third     491
Name: class, dtype: int64

In [16]:
d.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [17]:
d.describe(include='all')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
d.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

#### replace

In [20]:
d.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [21]:
s_fare = d['fare']
s_fare.head()

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: fare, dtype: float64

In [22]:
s_fare.replace([53.1000], np.nan, inplace=True)
s_fare.head()

0     7.2500
1    71.2833
2     7.9250
3        NaN
4     8.0500
Name: fare, dtype: float64

In [24]:
id(s_fare)

140229542305504

In [25]:
s_fare = s_fare.replace([7.9250], np.nan)
s_fare

0       7.2500
1      71.2833
2          NaN
3          NaN
4          NaN
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

In [26]:
id(s_fare)

140229490200736

In [27]:
s_fare.replace([7.7500], np.nan, inplace = True)
s_fare

0       7.2500
1      71.2833
2          NaN
3          NaN
4          NaN
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890        NaN
Name: fare, Length: 891, dtype: float64

In [28]:
id(s_fare)

140229490200736

In [ ]:
s_fare = s_fare.replace([7.9250], np.nan)
s_fare

In [ ]:
s_fare.replace([71.2833], np.nan, inplace=True)
s_fare.head()

## # Histogram

In [ ]:
d = sns.load_dataset('iris')
d.head(3)

In [ ]:
plt.hist(d['sepal_length'].dropna(), bins=30)
plt.show()

In [ ]:
plt.hist(d['sepal_length'].dropna(), bins=30, histtype='step')
plt.show()

#### filtering

In [ ]:
is_larger_than_5 = d['sepal_length'] > 5
is_larger_than_5.head(3)

In [ ]:
is_larger_than_5.sum(), is_larger_than_5.mean()

In [ ]:
# Filtering
len_sep = d['sepal_length']
sep_larger_than_5 = len_sep[is_larger_than_5]
sep_larger_than_5.mean()

In [ ]:
# Filtering
len_sep = d['sepal_length']
sep_larger_than_5 = len_sep[~is_larger_than_5]
sep_larger_than_5.mean()

In [ ]:
# Filtering
len_sep = d['sepal_length']

is_larger_than_5 = d['sepal_length'] > 5
is_smaller_than_6 = d['sepal_length'] < 6

sep_between_5_and_6 = len_sep[is_larger_than_5 & is_smaller_than_6]
sep_larger_than_5_and_6 = len_sep[is_larger_than_5 & ~is_smaller_than_6]
display(
    sep_between_5_and_6.head(5),
    sep_larger_than_5_and_6.head(5)
)

In [ ]:
sep_between_5_and_6.nunique()

In [ ]:
plt.hist(sep_between_5_and_6.dropna(), bins=11)
plt.show()

In [ ]:
plt.hist(sep_larger_than_5_and_6.dropna(), bins=10)
plt.show()

## # distributions

In [ ]:
import pandas as pd
gss = pd.read_hdf('gss.hdf5', 'gss')
gss.head(3)

In [ ]:
educ = gss['educ']
plt.hist(educ, label='educ')
plt.show()

In [ ]:
educ = gss['educ']
plt.hist(educ.dropna(), label='educ')
plt.show()

#### PMF

In [ ]:
from empiricaldist import Pmf
import pandas as pd

gss = pd.read_hdf('gss.hdf5', 'gss')
gss.head(3)

In [ ]:
gss_2012 = gss[gss['year']==2012]
gss_2012.head(2)

In [ ]:
educ = gss_2012['educ']
educ.head()

In [ ]:
pmf_educ = Pmf(educ)
pmf_educ.head()

#### NG

In [ ]:
# Select the age column (Series)
age = gss_2012['age']

# Make a PMF of age
pmf_age = Pmf(age)

# Plot the PMF
pmf_age.bar()

# Label the axes
plt.xlabel('Age')
plt.ylabel('PMF')
plt.show()

#### a.

In [ ]:
age = gss_2012['age']

In [ ]:
age.hist()

In [ ]:
age.values